/**
 * 全局错误码：对应错误提示
 */
const errorCode = {
    //系统级
    '-1': '参数错误',
    '-2': '数据库操作失败',
    '-3': '无操作权限',
    '403': '用户没有此操作权限',
    '202': '操作失败',
    
    //企业有关的参数错误码
    '1001': '企业不存在',
    '1011': '地图名称有重复',
    '1016': '区域名称有重复',
    '1017': '删除区域失败：存在设施',
    '1018': '删除区域失败：存在分组',
    '1021': '超出背景资源最大限制',
    '1026': '超出静态资源最大限制',

    //登录有关的参数错误码
    '2001': '账号或密码不正确',
    '2003': '账号已禁用',
    '1002': '该单位已禁用',
    '2004': '登录次数超出限制，请明日重试',
    '1003': '您所属的企业超出使用期限，请联系管理员',
    '2006': '帐号不存在',

    //账号有关的参数错误码
    '2002': '账号已存在',
    '2005': '原密码错误',
    '2007': '登录超时，请重新登录',
    '2011': '角色名称有重复',
    '2012': '角色删除失败',

    //设施有关的参数错误码
    '1012': '设施类型名称有重复',
    '3001': '设施分组名称有重复',
    '3002': '设施分组删除失败: 存在设施',
    '3003': '设施分组删除失败: 存在分组',
    '5001': '设施名称有重复',
    '5002': '设施编号有重复',
    '5003': '设施IP有重复',
    '5004': '设施MAC地址有重复',
    '5005': '设施登陆账号有重复',
    '5006': '超出最大设施数量',

    '6001': '文件描述重复',
};

/**
 * 成功状态码
 */
const successCode = '0';

export {
    errorCode,
    successCode,
};
  